---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IndexPrimitive Properties
IndexPrimitive Class See Also Send Feedback
---

The IndexPrimitive type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

IndexPrimitive Class

Autodesk.Revit.DB.DirectContext3D Namespace